mowglinext/mowglinext/firmware/stm32/ros_usbnode/src/drivemotor.c
        /* todo check for timeout */

        break;

    case RX_CRC_ERROR:
    case RX_INVALID_ERROR:
    case RX_TIMEOUT_ERROR:
    default:
        /* inform for error */
        break;
    }
}

/// @brief Decode received drive motor messages
/// @param
void DRIVEMOTOR_App_Rx(void)
{
    if (drivemotors_eRxFlag == RX_VALID)
    {
        /* decode */
        uint8_t direction = drivemotor_psReceivedData.u8_direction;
        // we need to adjust for direction (+/-) !
        if ((direction & 0xc0) == 0xc0)
        {
            left_direction = 1;
        }
        else if ((direction & 0x80) == 0x80)
        {
            left_direction = -1;
        }
        else
        {
            left_direction = 0;
        }
        if ((direction & 0x30) == 0x30)
        {
            right_direction = 1;
        }
        else if ((direction & 0x20) == 0x20)
        {
            right_direction = -1;
        }
        else
        {
            right_direction = 0;
        }

        left_encoder_val = drivemotor_psReceivedData.u16_left_ticks;
        right_encoder_val = drivemotor_psReceivedData.u16_right_ticks;

        // power consumption
        left_power = drivemotor_psReceivedData.u8_left_power;
        right_power = drivemotor_psReceivedData.u8_right_power;

        /*
         * Motor-controller encoder quirk: the 16-bit encoder register can
         * reset to 0 when the wheel's commanded direction changes (and again
         * when the speed crosses from 0 to non-zero). Detect those events
         * and restart the delta window so we don't register a massive phantom
         * jump.
         */
        /*
         * Direction-change fence: when `left_encoder_reset` is true the
         * motor-controller PCB is in the middle of a direction/speed
         * transient and its encoder register may or may not have been
         * zeroed by the controller yet. Rather than GUESS (which the old
         * `prev_left_encoder_val = 0` did, and failed catastrophically
         * when the controller had NOT reset yet: delta_raw =
         * current_encoder_val - 0 = tens of thousands of ticks
         * mistakenly attributed to the new direction, producing
         * ±1000 m/s bogus velocities downstream), we SYNC `prev` to
         * whatever the current encoder value is. Delta for this one
         * packet is then 0 — we concede up to ~21 ms of fine-grained
         * odometry tracking during the transient, which at 0.5 m/s max
         * is 10 mm — in exchange for never emitting a bogus tick-burst
         * on direction change.
         *
         * Subsequent packets compute deltas against the post-transient
         * baseline, so the rest of the trajectory is uncorrupted.
         */
        left_wheel_speed_val = left_direction * drivemotor_psReceivedData.u8_left_speed;
        const uint8_t left_encoder_reset =
            (left_direction == 0) ||
            (left_direction != prev_left_direction) ||
            (prev_left_wheel_speed_val == 0 && left_wheel_speed_val != 0);
        if (left_encoder_reset)
        {
            prev_left_encoder_val = left_encoder_val;  /* sync, not zero */
        }

        /* Encoder register wraps around 0xFFFF. We compute the delta as a
         * SIGNED int16 difference — natural wrap handling that works in
         * BOTH directions, provided the wheel hasn't spun >32767 ticks in
         * one 20 ms sample (~100 m/s — impossible for a mower).
         *
         * Previously this was an unsigned subtraction, which is only correct
         * for monotonically-increasing forward motion. Any backward motion
         * (mechanical backlash, motor coast through zero, PI overshoot) made
         * the encoder briefly count down — e.g. 100 → 91 read as uint16
         * delta=65527 instead of -9. That uint16 was then multiplied by the
         * motor direction byte, injecting a ±65,527-tick spike into
         * left_ticks_signed every time the wheel jittered through zero.
         * Once the wheel-level PI loop started consuming left_ticks_signed
         * for feedback, those spikes saturated the PI output and the chassis
         * spun at full ω while reporting ~0 m motion to the ROS host.
         */
        const int16_t left_delta_signed = (int16_t)(left_encoder_val - prev_left_encoder_val);
        const uint16_t left_delta_raw = (left_delta_signed >= 0)
                                            ? (uint16_t)left_delta_signed
                                            : (uint16_t)(-left_delta_signed);
        /* Legacy cumulative counter (unsigned-abs) kept for any existing
         * consumer that still expects monotonic positive ticks. */
        left_encoder_ticks += (uint32_t)left_delta_raw;
        /* Signed cumulative count — the encoder timer here is up-only, so we
         * still scale by the commanded motor direction. The signed delta cast
         * above only protects against backward-jitter spikes; for true reverse
         * motion the direction byte does the polarity flip. */
        left_ticks_signed += (int32_t)left_delta_signed * (int32_t)left_direction;
        prev_left_encoder_val = left_encoder_val;
        prev_left_wheel_speed_val = left_wheel_speed_val;
        prev_left_direction = left_direction;

        /* Same fence for the right wheel — direction-change transient is
         * per-wheel on a differential-drive platform (e.g. an in-place
         * pivot has left and right transitions at different times). */
        right_wheel_speed_val = right_direction * drivemotor_psReceivedData.u8_right_speed;
        const uint8_t right_encoder_reset =
            (right_direction == 0) ||
            (right_direction != prev_right_direction) ||
            (prev_right_wheel_speed_val == 0 && right_wheel_speed_val != 0);
        if (right_encoder_reset)
        {
            prev_right_encoder_val = right_encoder_val;  /* sync, not zero */
        }
        const int16_t right_delta_signed = (int16_t)(right_encoder_val - prev_right_encoder_val);
        const uint16_t right_delta_raw = (right_delta_signed >= 0)
                                             ? (uint16_t)right_delta_signed
                                             : (uint16_t)(-right_delta_signed);
        right_encoder_ticks += (uint32_t)right_delta_raw;
        right_ticks_signed += (int32_t)right_delta_signed * (int32_t)right_direction;
        prev_right_encoder_val = right_encoder_val;
        prev_right_wheel_speed_val = right_wheel_speed_val;
        prev_right_direction = right_direction;

        wheelTicks_handler(left_ticks_signed, right_ticks_signed,
                           left_wheel_speed_val, right_wheel_speed_val);

        drivemotors_eRxFlag = RX_WAIT; // ready for next message
    }
}

/**
 * @brief  Set drive motor speeds from a signed PWM command per wheel.
 *
 * Single scalar per wheel encodes both magnitude and direction: positive =
 * forward, negative = reverse, 0 = stop. The motor-controller PCB's legacy
 * (|speed|, direction-bit) interface is produced internally by this function.
 *
 * No host-side deadband: the PAC5210 motor controller handles sub-threshold
 * commands on its own. Saturates to 8-bit motor-controller magnitude range.
 *
 * @param  left_pwm_signed   signed PWM command for the left wheel
 * @param  right_pwm_signed  signed PWM command for the right wheel
 */
void DRIVEMOTOR_SetSpeedSigned(int16_t left_pwm_signed, int16_t right_pwm_signed)
{
    /* Saturate to the 8-bit motor-controller magnitude. */
    if (left_pwm_signed  >  255) left_pwm_signed  =  255;
    if (left_pwm_signed  < -255) left_pwm_signed  = -255;
    if (right_pwm_signed >  255) right_pwm_signed =  255;
    if (right_pwm_signed < -255) right_pwm_signed = -255;

    left_speed_req  = (uint8_t)(left_pwm_signed  < 0 ? -left_pwm_signed  : left_pwm_signed);
    right_speed_req = (uint8_t)(right_pwm_signed < 0 ? -right_pwm_signed : right_pwm_signed);

    /* Motor-controller convention: dir=1 → forward at |speed|, dir=0 →
     * reverse at |speed| (or stop when |speed|=0). Only forward maps to
     * a non-zero dir byte. */
    left_dir_req  = (left_pwm_signed  > 0) ? 1 : 0;
    right_dir_req = (right_pwm_signed > 0) ? 1 : 0;
}

/**
 * @brief  Legacy 4-argument form kept as a thin shim over the signed API so
 *         any caller that still uses `(speed, speed, dir, dir)` keeps
 *         working. New code should call DRIVEMOTOR_SetSpeedSigned directly.
 */
void DRIVEMOTOR_SetSpeed(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{
    const int16_t l_signed = left_dir  ? (int16_t)left_speed  : -(int16_t)left_speed;
    const int16_t r_signed = right_dir ? (int16_t)right_speed : -(int16_t)right_speed;
    /* If both speeds are 0, the deadband path passes 0 through unchanged,
     * matching the old "0,0,0,0 == stop" contract. */
    DRIVEMOTOR_SetSpeedSigned(
        (left_speed  == 0) ? 0 : l_signed,
        (right_speed == 0) ? 0 : r_signed);
}

/// @brief drive motor receive interrupt handler
/// @param
void DRIVEMOTOR_ReceiveIT(void)
{
    /* decode the frame */
    if (memcmp(drivemotor_pcu8Preamble, (uint8_t *)&drivemotor_psReceivedData, 5) == 0)
    {
        uint8_t l_u8crc = crcCalc((uint8_t *)&drivemotor_psReceivedData, DRIVEMOTOR_LENGTH_RECEIVED_MSG - 1);
        if (drivemotor_psReceivedData.u8_CRC == l_u8crc)
        {
            drivemotors_eRxFlag = RX_VALID;
        }
        else
        {
            drivemotors_eRxFlag = RX_CRC_ERROR;
        }
    }
    else
    {
        drivemotors_eRxFlag = RX_INVALID_ERROR;
    }
}

/******************************************************************************
 *  Private Functions
 *******************************************************************************/

__STATIC_INLINE void drivemotor_prepareMsg(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{

    uint8_t direction = 0x0;

    // calc direction bits
    if (right_dir == 1)
    {
        direction |= (0x20 + 0x10);
    }
    else
    {
        direction |= 0x20;
    }
    if (left_dir == 1)
    {
        direction |= (0x40 + 0x80);
    }
    else
    {
        direction |= 0x80;
    }

    drivemotor_pu8RqstMessage[0] = 0x55;
    drivemotor_pu8RqstMessage[1] = 0xaa;
    drivemotor_pu8RqstMessage[2] = 0x08;
    drivemotor_pu8RqstMessage[3] = 0x10;
    drivemotor_pu8RqstMessage[4] = 0x80;
    drivemotor_pu8RqstMessage[5] = direction;
    drivemotor_pu8RqstMessage[6] = left_speed;
    drivemotor_pu8RqstMessage[7] = right_speed;
    drivemotor_pu8RqstMessage[9] = 0;
    drivemotor_pu8RqstMessage[8] = 0;
    drivemotor_pu8RqstMessage[10] = 0;
    drivemotor_pu8RqstMessage[11] = crcCalc(drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG - 1);
}
